Repository: Rana-Alngashy/AllAble
Catalog: *.lproj/Localizable.strings
Languages: ar

# Account.Name
source: Child's Name
ar: الاسم

# Account.Age
source: Child's Age
ar: العمر

# Button.Save
source: Save
ar: حفظ

# Button.Next
source: NEXT
ar: التالي

# Title.ChooseCharacter
source: Choose Your Character
ar: اختر شخصيتك

# Title.UserInfo
source: Child's Information
ar: بيانات المستخدم

# Title.ParentVerification
source: Parent Account Verification
ar: تحقق ولي الأمر

# Title.InsulinTimer
source: Insulin Timer
ar: مؤقت الأنسولين

# Button.StartTimer
source: Start Timer
ar: بدء المؤقت

# Title.Meals
source: Meals
ar: الوجبات

# EmptyState.NoLog
source: No items found in the log
ar: لم يتم العثور على أي وجبات في السجل

# MealCard.Name
source: Name of the meal:
ar: اسم الوجبة:

# MealCard.Carb
source: Carb:
ar: الكاربوهيدرات:

# MealCard.InsulinDose
source: Insulin dose:
ar: جرعة الأنسولين:

# Type.Breakfast
source: Breakfast
ar: فطور

# Type.Lunch
source: Lunch
ar: غداء

# Type.Dinner
source: Dinner
ar: عشاء

# Type.Snacks
source: Snacks
ar: سناكس

# Title.CalculateMeal
source: Calculate My Meal
ar: احسب وجبتي

source: Total carbs:
ar: إجمالي الكاربوهيدرات:

# Title.MealContents
source: Meal Contents
ar: محتويات الوجبة

# Label.MainMeal
source: Main Meal
ar: الوجبة الرئيسية

# Placeholder.MealName
source: Meal name
ar: اسم الوجبة

# Placeholder.Carbs
source: Carbs
ar: الكاربوهيدرات

# Label.SubItems
source: Add Sub Items
ar: إضافة أصناف فرعية

# Button.CalculateInsulin
source: Calculate Insulin
ar: احسب الأنسولين

# Title.InsulinDose
source: Your Insulin Dose
ar: جرعة الأنسولين

# Label.CarbRatio
source: Carb Ratio
ar: نسبة الكاربوهيدرات

# Button.Continue
source: Continue
ar: متابعة

# Title.InsulinShot
source: Did you take the insulin shot?
ar: هل تناولت جرعة الأنسولين؟

# Button.YesTimer
source: Yes, Start Timer
ar: نعم، ابدأ المؤقت

# Button.NoReminder
source: No, Set Reminder
ar: لا، اضبط تذكير

# Title.SetReminder
source: Set Insulin Reminder
ar: اضبط تذكير الأنسولين

# Label.SelectTime
source: Select Reminder Time
ar: حدد وقت التذكير

# Button.SaveFinish
source: Save and Finish
ar: حفظ وإنهاء

# Notification.Title
source: Insulin Update
ar: تحديث الأنسولين

# Notification.Body
source: Update your status.
ar: يرجى تحديث حالتك.

# Title.Fantastic
source: Fantastic!
ar: رائع!

# Message.DoseComplete
source: Dose complete! You managed your insulin like a pro.
ar: تمت الجرعة بنجاح! لقد أدرت الأنسولين كالمحترفين.

# LastDose.Title
source: Last insulin dose calculation
ar: آخر جرعة أنسولين تم حسابها

# LastDose.NoDose
source: No insulin dose yet
ar: لم تُحسب أي جرعة بعد

# Button.MyMeals
source: My Previous Meals
ar: وجباتي السابقة
